larrytsai1980/nRF52840-zigbee-color-light-bulb/main.c
    // set RGB value to color LEDs
    rgb_color_set(led_params.r_value, led_params.g_value, led_params.b_value);
}

/**@brief Function for changing the hue of the light bulb.
 *
 * @param[IN] new_hue       New value for hue.
 */
static void color_control_set_value_hue(zb_uint8_t new_hue)
{
    NRF_LOG_INFO("Set color hue value: %i", new_hue);
    zb_set_hsb_color_values(new_hue, zb_dev_ctx.color_control_attr.set_color_info.current_saturation, zb_dev_ctx.level_control_attr.current_level);
}

/**@brief Function for changing the saturation of the light bulb.
 *
 * @param[IN] new_saturation new value for saturation.
 */
static void color_control_set_value_saturation(zb_uint8_t new_saturation)
{
    NRF_LOG_INFO("Set color saturation value: %i", new_saturation);
    zb_set_hsb_color_values(zb_dev_ctx.color_control_attr.set_color_info.current_hue, new_saturation, zb_dev_ctx.level_control_attr.current_level);
}

/**@brief Function for setting the light bulb brightness.
 *
 * @param[IN] new_level    Light bulb brightness value.
 */
static void level_control_set_value(zb_uint16_t new_level)
{
    NRF_LOG_INFO("Set level value: %i", new_level);
    zb_set_hsb_color_values(zb_dev_ctx.color_control_attr.set_color_info.current_hue, zb_dev_ctx.color_control_attr.set_color_info.current_saturation, new_level);

    /* According to the table 7.3 of Home Automation Profile Specification v 1.2 rev 29, chapter 7.1.3. */
   zb_dev_ctx.on_off_attr.on_off = (new_level ? ZB_TRUE : ZB_FALSE);
}

/**@brief Function for turning ON/OFF the light bulb.
 *
 * @param[IN] p_ep_dev_ctx Pointer to endpoint device ctx.
 * @param[IN] on           Boolean light bulb state.
 */
static void on_off_set_value(zb_bool_t on)
{
    zb_dev_ctx.on_off_attr.on_off = on;

    NRF_LOG_INFO("Set ON/OFF value: %i", on);
    if (on)
    {
        level_control_set_value(zb_dev_ctx.level_control_attr.current_level);
    }
    else
    {
        led_params.r_value = 0;
        led_params.g_value = 0;
        led_params.b_value = 0;
        rgb_color_set(led_params.r_value, led_params.g_value, led_params.b_value);
    }
}

/***************************************************************************************************
 * @section Zigbee stack related functions.
 **************************************************************************************************/

/**@brief Indicate the commissioning in progress.
 *
 * @param[in]   param   Reference to ZigBee stack buffer that will be used to construct leave request.
 */
static void zb_commissioning_indication(zb_uint8_t led_state)
{
    zb_ret_t zb_err_code;

    if(ZB_JOINED() == ZB_FALSE)
    {
        if (led_state)
        {
            led_params.r_value = 0;
            led_params.g_value = 100;
            led_params.b_value = 0;
            rgb_color_set(led_params.r_value, led_params.g_value, led_params.b_value);
            zb_err_code = ZB_SCHEDULE_ALARM(zb_commissioning_indication, 0, ZB_MILLISECONDS_TO_BEACON_INTERVAL(200));
            ZB_ERROR_CHECK(zb_err_code);
        }
        else
        {
            led_params.r_value = 0;
            led_params.g_value = 0;
            led_params.b_value = 0;
            rgb_color_set(led_params.r_value, led_params.g_value, led_params.b_value);
            zb_err_code = ZB_SCHEDULE_ALARM(zb_commissioning_indication, 1, ZB_MILLISECONDS_TO_BEACON_INTERVAL(2000));
            ZB_ERROR_CHECK(zb_err_code);
        }
    }
}

/**@brief Perform local operation - leave network.
 *
 * @param[in]   param   Reference to ZigBee stack buffer that will be used to construct leave request.
 */
static void device_leave_nwk(zb_uint8_t param)
{
    zb_ret_t zb_err_code;

    /* We are going to leave */
    if (param)
    {
        zb_buf_t                  * p_buf = ZB_BUF_FROM_REF(param);
        zb_zdo_mgmt_leave_param_t * p_req_param;

        p_req_param = ZB_GET_BUF_PARAM(p_buf, zb_zdo_mgmt_leave_param_t);
        UNUSED_RETURN_VALUE(ZB_BZERO(p_req_param, sizeof(zb_zdo_mgmt_leave_param_t)));

        /* Set dst_addr == local address for local leave */
        p_req_param->dst_addr = ZB_PIBCACHE_NETWORK_ADDRESS();
        p_req_param->rejoin   = ZB_FALSE;
        UNUSED_RETURN_VALUE(zdo_mgmt_leave_req(param, NULL));
    }
    else
    {
        zb_err_code = ZB_GET_OUT_BUF_DELAYED(device_leave_nwk);
        ZB_ERROR_CHECK(zb_err_code);
    }
}


/**@brief Function for starting join/rejoin procedure.
 *
 * param[in]   leave_type   Type of leave request (with or without rejoin).
 */
static zb_void_t device_retry_join(zb_uint8_t leave_type)
{
    zb_bool_t comm_status;

    if (leave_type == ZB_NWK_LEAVE_TYPE_RESET)
    {
        comm_status = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);
        ZB_COMM_STATUS_CHECK(comm_status);
    }
}


/**@brief Function for leaving current network and starting join procedure afterwards.
 *
 * @param[in]   param   Optional reference to ZigBee stack buffer to be reused by leave and join procedure.
 */
static zb_void_t device_leave_and_join(zb_uint8_t param)
{
    if (ZB_JOINED())
    {
        /* Leave network. Joining procedure will be initiated inisde ZigBee stack signal handler. */
        device_leave_nwk(param);
    }
    else
    {
        /* Already left network. Start joining procedure. */
        device_retry_join(ZB_NWK_LEAVE_TYPE_RESET);

        if (param)
        {
            ZB_FREE_BUF_BY_REF(param);
        }
    }
}

/**@brief Callback for button events.
 *
 * @param[in]   evt      Incoming event from the BSP subsystem.
 */
static void buttons_handler(bsp_event_t evt)
{
    zb_ret_t zb_err_code;

    switch(evt)
    {
        case BSP_EVENT_KEY_0:
            if (zb_dev_ctx.identify_attr.identify_time == ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE)
            {
                /* Put specified endpoint in identifying mode */
                zb_err_code = zb_bdb_finding_binding_target(HA_COLOR_LIGHT_ENDPOINT);
                ZB_ERROR_CHECK(zb_err_code);
                NRF_LOG_INFO("Endpoint %hd put in identifying mode", HA_COLOR_LIGHT_ENDPOINT);
            }
            else
            {
                /* Print remaining time to stay in identifying mode for every endpoint. */
                NRF_LOG_INFO("Ep %hd identify time: %hd", HA_COLOR_LIGHT_ENDPOINT, zb_dev_ctx.identify_attr.identify_time);
            }
            break;
        default:
            NRF_LOG_INFO("Unhandled BSP Event received: %d", evt);
            break;
    }
}


