larrytsai1980/nRF52840-zigbee-color-light-bulb/main.c
/**@brief Function for initializing LEDs and buttons.
 */
static void leds_buttons_init(void)
{
    ret_code_t error_code;

    /* Initialize LEDs and buttons - use BSP to control them. */
    error_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, buttons_handler);
    APP_ERROR_CHECK(error_code);
    bsp_board_leds_off();
}

/**@brief Function for handling commands received from the Nordic UART Service.
 *
 * @details This function will check received data agains predefined commands and
 *          generate a corresponding Zigbee request upon successfull match.
 *
 * @param[in] p_command_str  Command string received over UART.
 * @param[in] length         Length of the data.
 */
static void zigbee_command_handler(const uint8_t * p_command_str, uint16_t length)
{
    zb_zcl_status_t zcl_status;


    /* Process received NUS command */
    if (strncmp(COMMAND_ON, (char *)p_command_str, strlen(COMMAND_ON)) == 0)
    {
        /* Turn off LED */
        on_off_set_value((zb_bool_t)ZB_ZCL_ON_OFF_IS_ON);
    }
    else if (strncmp(COMMAND_OFF, (char *)p_command_str, strlen(COMMAND_OFF)) == 0)
    {
        /* Turn on LED */
        on_off_set_value((zb_bool_t)ZB_ZCL_ON_OFF_IS_OFF);
    }
    else if (strncmp(COMMAND_WHITE, (char *)p_command_str, strlen(COMMAND_WHITE)) == 0)
    {
        /* Set LED color to white */
        zb_set_hsb_color_values(0, 0 , zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_RED, (char *)p_command_str, strlen(COMMAND_RED)) == 0)
    {
        /* Set LED color to red */
        zb_set_hsb_color_values(0, 254, zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_YELLOW, (char *)p_command_str, strlen(COMMAND_YELLOW)) == 0)
    {
        /* Set LED color to yellow */
        zb_set_hsb_color_values(42, 254, zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_GREEN, (char *)p_command_str, strlen(COMMAND_GREEN)) == 0)
    {
        /* Set LED color to green */
        zb_set_hsb_color_values(84, 254, zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_CYAN, (char *)p_command_str, strlen(COMMAND_CYAN)) == 0)
    {
        /* Set LED color to cyan */
        zb_set_hsb_color_values(127, 254, zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_BLUE, (char *)p_command_str, strlen(COMMAND_BLUE)) == 0)
    {
        /* Set LED color to blue */
        zb_set_hsb_color_values(169, 254, zb_dev_ctx.level_control_attr.current_level);
    }
    else if (strncmp(COMMAND_PURPLE, (char *)p_command_str, strlen(COMMAND_PURPLE)) == 0)
    {
        /* Set LED color to purple */
        zb_set_hsb_color_values(195, 218, zb_dev_ctx.level_control_attr.current_level);
    }
    else
    {
        NRF_LOG_INFO("Unrecognized UART command received:");
        NRF_LOG_HEXDUMP_INFO(p_command_str, length);
    }
}

/**@brief Function for initializing clusters attributes.
 * 
 * @param[IN]   p_device_ctx   Pointer to structure with device_ctx.
 * @param[IN]   ep_id          Endpoint ID.
 */
static void bulb_clusters_attr_init(zb_bulb_dev_ctx_t * p_device_ctx, zb_uint8_t ep_id)
{
    /* Basic cluster attributes data */
    p_device_ctx->basic_attr.zcl_version   = ZB_ZCL_VERSION;
    p_device_ctx->basic_attr.app_version   = BULB_INIT_BASIC_APP_VERSION;
    p_device_ctx->basic_attr.stack_version = BULB_INIT_BASIC_STACK_VERSION;
    p_device_ctx->basic_attr.hw_version    = BULB_INIT_BASIC_HW_VERSION;

    /* Use ZB_ZCL_SET_STRING_VAL to set strings, because the first byte should
     * contain string length without trailing zero.
     *
     * For example "test" string wil be encoded as:
     *   [(0x4), 't', 'e', 's', 't']
     */
    ZB_ZCL_SET_STRING_VAL(p_device_ctx->basic_attr.mf_name,
                          BULB_INIT_BASIC_MANUF_NAME,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MANUF_NAME));

    ZB_ZCL_SET_STRING_VAL(p_device_ctx->basic_attr.model_id,
                          BULB_INIT_BASIC_MODEL_ID,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MODEL_ID));

    ZB_ZCL_SET_STRING_VAL(p_device_ctx->basic_attr.date_code,
                          BULB_INIT_BASIC_DATE_CODE,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_DATE_CODE));

    p_device_ctx->basic_attr.power_source = BULB_INIT_BASIC_POWER_SOURCE;

    ZB_ZCL_SET_STRING_VAL(p_device_ctx->basic_attr.location_id,
                          BULB_INIT_BASIC_LOCATION_DESC,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_LOCATION_DESC));


    p_device_ctx->basic_attr.ph_env = BULB_INIT_BASIC_PH_ENV;

    /* Identify cluster attributes data */
    p_device_ctx->identify_attr.identify_time       = ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;
    p_device_ctx->identify_attr.commission_state    = ZB_ZCL_ATTR_IDENTIFY_COMMISSION_STATE_HA_ID_DEF_VALUE;

    /* On/Off cluster attributes data */
    p_device_ctx->on_off_attr.on_off                = (zb_bool_t)ZB_ZCL_ON_OFF_IS_ON;
    p_device_ctx->on_off_attr.global_scene_ctrl     = ZB_TRUE;
    p_device_ctx->on_off_attr.on_time               = 0;
    p_device_ctx->on_off_attr.off_wait_time         = 0;

    /* Level control cluster attributes data */
    p_device_ctx->level_control_attr.current_level  = ZB_ZCL_LEVEL_CONTROL_LEVEL_MAX_VALUE; // Set current level value to maximum
    p_device_ctx->level_control_attr.remaining_time = ZB_ZCL_LEVEL_CONTROL_REMAINING_TIME_DEFAULT_VALUE;
    ZB_ZCL_LEVEL_CONTROL_SET_ON_OFF_VALUE(ep_id, p_device_ctx->on_off_attr.on_off);
    ZB_ZCL_LEVEL_CONTROL_SET_LEVEL_VALUE(ep_id, p_device_ctx->level_control_attr.current_level);
    
    /* Color control cluster attributes data */
    p_device_ctx->color_control_attr.set_color_info.current_hue         = ZB_ZCL_COLOR_CONTROL_HUE_RED;
    p_device_ctx->color_control_attr.set_color_info.current_saturation  = ZB_ZCL_COLOR_CONTROL_CURRENT_SATURATION_MAX_VALUE;

    /* Set to use hue & saturation */
    p_device_ctx->color_control_attr.set_color_info.color_mode          = ZB_ZCL_COLOR_CONTROL_COLOR_MODE_HUE_SATURATION;
    p_device_ctx->color_control_attr.set_color_info.color_temperature   = ZB_ZCL_COLOR_CONTROL_COLOR_TEMPERATURE_DEF_VALUE;
    p_device_ctx->color_control_attr.set_color_info.remaining_time      = ZB_ZCL_COLOR_CONTROL_REMAINING_TIME_MIN_VALUE;
    p_device_ctx->color_control_attr.set_color_info.color_capabilities  = ZB_ZCL_COLOR_CONTROL_CAPABILITIES_HUE_SATURATION;

    /* According to ZCL spec 5.2.2.2.1.12 0x00 shall be set when CurrentHue and CurrentSaturation are used. */
    p_device_ctx->color_control_attr.set_color_info.enhanced_color_mode = 0x00;

    /* According to 5.2.2.2.1.10 execute commands when device is off. */
    p_device_ctx->color_control_attr.set_color_info.color_capabilities  = ZB_ZCL_COLOR_CONTROL_OPTIONS_EXECUTE_IF_OFF;

